# ZoneDesignHeatTemperature Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ZoneDesignHeatTemperature Property
ParameterTypeId Class See Also
---
"Design Temperature for Heating"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ZoneDesignHeatTemperature { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZoneDesignHeatTemperature As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ZoneDesignHeatTemperature {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace